app/controllers/listings_controller.rb

    def index
        listings = Listing.all
---
SELECT "listings".* FROM "listings"

    def create
        listing = current_user.listings.create listing_params
---
INSERT INTO "listings" ("address", "price", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["address", "asdf"], ["price", 1], ["created_at", "2019-11-27 01:36:32.585766"], ["updated_at", "2019-11-27 01:36:32.585766"], ["user_id", 5.0]]